posts/samba/index.org
#+BEGIN_COMMENT
.. title: samba 文件共享
.. slug: samba
.. date: 2020-12-24 12:37:06 UTC+08:00
.. tags: linux, samba 
.. category: tools
.. link: 
.. description: 
.. type: text

#+END_COMMENT

* Samba 基本配置
  参考 [[https://www.fosslinux.com/8703/how-to-setup-samba-file-sharing-server-on-ubuntu.htm][FossLinux 的文章]]。

  
** 安装 Samba
   #+begin_src bash
apt install samba
   #+end_src    

** 添加组和用户
   假定已经有一个本地用户 ~mylocaluser~
   #+begin_src bash
# 创建 smb 的组
/usr/sbin/addgroup smbgroup
# 把用户加到组里
/usr/sbin/usermod -aG smbgroup mylocaluser
# 设置用户的远程密码，可以与本地登录密码不同
smbpasswd -a mylocaluser
   #+end_src    

** 配置文件
   首先一定要备份一份
   #+begin_src bash
cp /etc/samba/smb.conf /etc/samba/smb.conf.backup
   #+end_src    

   配置文件修改如下，没有的项目就加进去，已有的就修改一下
   #+BEGIN_SRC cfg
[global]

# 允许用户登录
security = user

[homes]

read only = no

   #+END_SRC

   如果要加入其它登录地址，例如 ~smb://ip/newport~ 就如下配置
   #+BEGIN_SRC cfg
[newport]
path = /path/to/files
valid users = @smbgroup
guest ok = no
writable = yes
browsable = yes
   #+END_SRC


  
* 软链接权限
  从别处软链接过来的文件夹打不开，因为没有配置软链接的权限，只要在 ~[global]~ 里加入下面的内容就行了。

  参考：[[https://blog.csdn.net/cityzenoldwang/article/details/61189653][这个博客]]
  #+BEGIN_SRC
[global]
wide links = yes
symlinks = yes
unix extensions = no
  #+END_SRC

